package COCI06_Contest4

/**
 * N : 3
 * 초기값 : 모두 1
 *LEVEL 0                              1
 *LEVEL 1                         1        1
 *LEVEL 2                     1     1    1    1
 *
 * LEVEL 0 이하로 왼쪽, 오른쪽 합의 차이는 1 => LEVEL1 왼쪽에 1을 더해줌
 *
 *LEVEL 0                              1
 *LEVEL 1                         2        1
 * ===========================================================
 *LEVEL 2                     1     1    1    1
 *
 * 합 조건은 만족 , 유니크 조건은(LEVEL 1 이하에서만 : LEVEL0 , LEVEL1) 만족 X => LEVEL1 왼쪽, 오른쪽에 모두 1을 더해줌 ( 합 조건은 유지하기 위해 같은 값을 더해줌)
 *LEVEL 0                              1
 *LEVEL 1                         3        2
 * ===========================================================
 *LEVEL 2                     1     1    1    1

 LEVEL 1 : 만족
 LEVEL 2 : 왼쪽, 오른쪽 차이가 2 => 양쪽에 2를 더해줌
 *LEVEL 0                              1
 *LEVEL 1                         3        2
 * ===========================================================
 *LEVEL 2                     1     1    1    1
 *
 *
 * LEVEL2 : 합 조건 만족, 유니크 X
 *LEVEL 0                              1
 *LEVEL 1                         3        2
 * ===========================================================
 *LEVEL 2                     3     1    3    1
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 * 3 1 3 1 => 4 2 5 1 => 5 3 7 1 => 6 4 7
 *
 *LEVEL 0                              1
 *LEVEL 1                         3        2
 * ===========================================================
 *LEVEL 2                     6     5    7     4
  ㅁㄴㅇㄻㄴㅇㄻ


 ;;;;

 */

